* *Find Armstrong / narcissistic numbers*
** Description
*Exercise text from "Short & Sweet Math Challenges for HP fans #3"*

Find *all* numbers of N digits that are equal to the sum of the N-th powers of
their digits. You must find the numbers themselves, as well as just how many
there are for each N. The digit 0 *won't* be accepted as first digit, so for
instance 153 may be a solution for N=3 but 032 wouldn't even be tested.
Example: 1^3+5^3+3^3=153

*** Author
Jonathan van der Steege <jonathan@jonakeys.nl> - February 2024
*** How to use:
Enter an integer (N) and press f LBL A to start the search. When a valid number is
found, it is added to matrix A. The display shows 0.0000 when finished.
*** Answers:
- 1 : 1 2 3 4 5 6 7 8 9
- 2 : (none)
- 3 : 153 370 371 407
- 4 : 1634 8208 9474
** Program resources
*** Labels
- A: Start of program
- B: Fill storage registers (x^N)
- C: Calculate value of number
- D: Iterate over digits
- E: Decrease digit counter
- .9: End
*** Storage registers
- R1-R9: x^N
- R.0: N digits
- R.1: Loop from
- R.2: Loop to
- R.3: Sum number
- R.4: Digit counter
- R.5: Working number
*** Matrix
- A: Result numbers
** Program
*** Code:
| 000 | *Keystrokes* | *Key Codes* | *Comments*                       |
| 001 | f LBL A      | 42,21,11    | A: Start of program              |
| 002 | STO .0       | 44,.0       |                                  |
| 003 | 10^x         | 13          |                                  |
| 004 | STO .2       | 44,.2       | Set loop to (excl) 10^N          |
| 005 | g LSTx       | 43,36       |                                  |
| 006 | 1            | 1           |                                  |
| 007 | -            | 30          |                                  |
| 008 | 10^x         | 13          |                                  |
| 009 | STO .1       | 44,.1       | Set loop from 10^(N-1)           |
| 010 | 1            | 1           | Loop from 1 to 9                 |
| 011 | .            | 48          |                                  |
| 012 | 0            | 0           |                                  |
| 013 | 0            | 0           |                                  |
| 014 | 9            | 9           |                                  |
| 015 | STO I        | 44,25       |                                  |
| 016 | 1            | 1           | Setup results matrix             |
| 017 | ENTER        | 36          |                                  |
| 018 | 9            | 9           |                                  |
| 019 | f DIM A      | 42,23,11    |                                  |
| 020 | 0            | 0           |                                  |
| 021 | STO MATRIX A | 44,16,11    |                                  |
| 022 | f LBL B      | 42,21,12    | Fill R2-R9: x^N                  |
| 023 | RCL I        | 45,25       |                                  |
| 024 | g INT        | 43,44       |                                  |
| 025 | RCL .0       | 45,.0       |                                  |
| 026 | y^x          | 14          |                                  |
| 027 | STO f (i)    | 44,24       |                                  |
| 028 | f ISG I      | 42,6,25     |                                  |
| 029 | GTO B        | 22,12       |                                  |
| 030 | 1            | 1           |                                  |
| 031 | STO - .1     | 44,30,.1    |                                  |
| 032 | f LBL C      | 42,21,13    | Calculate value of number        |
| 033 | 1            | 1           |                                  |
| 034 | STO + .1     | 44,40,.1    |                                  |
| 035 | RCL .2       | 45,.2       | .2 = loop to                     |
| 036 | RCL .1       | 45,.1       | .1 = loop from                   |
| 037 | g TEST 7     | 43,30,7     | If from>to: done                 |
| 038 | GTO .9       | 22,.9       |                                  |
| 039 | RCL .0       | 45,.0       | .0 = N                           |
| 040 | STO .4       | 44,.4       | .4 = digit counter               |
| 041 | RCL .1       | 45,.1       |                                  |
| 042 | STO .5       | 44,.5       | .5 = working number              |
| 043 | g CLX        | 43,35       | Clear sum                        |
| 044 | STO .3       | 44,.3       | .3 = sum                         |
| 045 | f LBL D      | 42,21,14    | Iterate over digits              |
| 046 | RCL .5       | 45,.5       |                                  |
| 047 | g INT        | 43,44       |                                  |
| 048 | 1            | 1           |                                  |
| 049 | 0            | 0           |                                  |
| 050 | รท            | 10          |                                  |
| 051 | STO .5       | 44,.5       |                                  |
| 052 | g LSTx       | 43,36       |                                  |
| 053 | x<>y         | 34          |                                  |
| 054 | f FRAC       | 42,44       |                                  |
| 055 | x            | 20          |                                  |
| 056 | g TEST 4     | 43,30,4     | Skip if digit<=0                 |
| 057 | GTO E        | 22,15       |                                  |
| 058 | g INT        | 43,44       |                                  |
| 059 | STO I        | 44,25       | Store current digit in I         |
| 060 | 1            | 1           |                                  |
| 061 | g TEST 6     | 43,30,6     |                                  |
| 062 | RCL (i)      | 45,24       | Get stored value (x^N)           |
| 063 | STO + .3     | 44,40,.3    | Add to sum                       |
| 064 | RCL .1       | 45,.1       |                                  |
| 065 | RCL .3       | 45,.3       |                                  |
| 066 | g TEST 7     | 43,30,7     | If sum>number: go to next number |
| 067 | GTO C        | 22,13       |                                  |
| 068 | f LBL E      | 42,21,15    |                                  |
| 069 | f DSE .4     | 42,5,.4     | Decrease digit counter           |
| 070 | GTO D        | 22,14       |                                  |
| 071 | g TEST 5     | 43,30,5     | Check sum = number               |
| 072 | u STO A      | u,44,11     | Store result if equal            |
| 073 | GTO C        | 22,13       |                                  |
| 074 | f LBL .9     | 42,21,.9    | End (return)                     |
| 075 | g CLX        | 43,35       |                                  |
| 076 | f MATRIX 1   | 42,16,1     |                                  |
| 077 | g RTN        | 43,32       |                                  |
#+tblfm: $1=@#-1;%03d
